---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.LoadComponent
source: html/2c15a9d9-5669-7f5b-d0b9-519c91a343b6.htm
---
# LoadComponent Members

Constructs a new instance of a LoadComponent.
 The load case or combination id.
 The load case or combination factor.